<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"e925c06dca6efc79ec155224bf378e6630e7d4975f771c07b5c2a47a96a32228","plan_job_ref":"Job terraform plan #19 at https://github.com/suzutan/infra/actions/runs/8765046839","plan_out_hash":"388aece8f86e2c2e2d255681e0359e06c71c9928086c4efc6559fc53c42676ac","plan_hash":"7dae6babcbb9bb304c2c36ed980f62fadbe1416a0a43be3b8f3bae73d7607bcb","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_record.dkim_1 will be created
+   resource "cloudflare_record" "dkim_1" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "s1._domainkey.mail.harvestasya.org"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "CNAME"
+       value           = "s1.domainkey.u43989729.wl230.sendgrid.net"
+       zone_id         = "********************************"
    }

  # cloudflare_record.dkim_2 will be created
+   resource "cloudflare_record" "dkim_2" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "s2._domainkey.mail.harvestasya.org"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "CNAME"
+       value           = "s2.domainkey.u43989729.wl230.sendgrid.net"
+       zone_id         = "********************************"
    }

  # cloudflare_record.dmarc will be created
+   resource "cloudflare_record" "dmarc" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "_dmarc.mail.harvestasya.org"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "TXT"
+       value           = "v=DMARC1; p=none;"
+       zone_id         = "********************************"
    }

  # cloudflare_record.sendgrid_mail will be created
+   resource "cloudflare_record" "sendgrid_mail" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "em1456.mail.harvestasya.org"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "CNAME"
+       value           = "u43989729.wl230.sendgrid.net"
+       zone_id         = "********************************"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #19](https://github.com/suzutan/infra/actions/runs/8765046839)